In [27]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sklearn
import tensorflow as tf

In [54]:
tf.__version__

'2.3.0'

In [2]:
A = pd.Series([2,4,6], index=[0,1,2])
B = pd.Series([1,3,5], index=[1,2,3])
print(A)
print()
print(B)
print()
print(A+B)
print()
A+B #단순 합이면 빈 칸이 생김
print(A.add(B, fill_value=0)) #A에 B를 추가하면 빈 칸이 추가되지 않음

0    2
1    4
2    6
dtype: int64

1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [3]:
# dropna(): 제거, average(), 평균치로 치환. 많이 씀
A = pd.DataFrame(np.random.randint(0,10,(2,2)), columns=list("AB"))
B = pd.DataFrame(np.random.randint(0,10,(3,3)), columns=list("BAC"))

In [4]:
print(A)
print()
print(B)

   A  B
0  9  2
1  1  7

   B  A  C
0  6  8  3
1  2  8  0
2  2  6  1

In [5]:
print(A+B) #그냥 더하면 실수로 바뀌고, 빈 공간이 생김

      A    B   C
0  17.0  8.0 NaN
1   9.0  9.0 NaN
2   NaN  NaN NaN

In [8]:
A.add(B, fill_value=0) #A에 B를 붙이는데 fill_value로 빈 칸 0으로 채우기!
#outer join cd.default = inner join

      A    B    C
0  17.0  8.0  3.0
1   9.0  9.0  0.0
2   6.0  2.0  1.0

In [15]:
data = {
    'A': [i+5 for i in range(3)],
    'B': [i**2 for i in range(3)]
}
df = pd.DataFrame(data)
print(df)
print()
print(df['A'].sum())
print()
print(df.sum())
print()
print(df.mean())

   A  B
0  5  0
1  6  1
2  7  4

18

A    18
B     5
dtype: int64

A    6.000000
B    1.666667
dtype: float64

In [26]:
data_a = {
    'A': [i+3 for i in range(5)],
    'B': [i*i for i in range(5)]
}
data_b = {
    'C': [i-4 for i in range(5,10)]
}
df_a = pd.DataFrame(data_a)
df_b = pd.DataFrame(data_b)
print(df_a)
print()
print(df_b)

   A   B
0  3   0
1  4   1
2  5   4
3  6   9
4  7  16

   C
0  1
1  2
2  3
3  4
4  5

In [30]:
#값으로 정렬하기!
#먼저 데이터프레임을 만든다.
df = pd.DataFrame({
    'col1':[2,1,4,6,7,10],
    'col2':['a','a','b',np.nan,'d','c'],
    'col3':[0,1,9,4,2,3]
})
df

   col1 col2  col3
0     2    a     0
1     1    a     1
2     4    b     9
3     6  NaN     4
4     7    d     2
5    10    c     3

In [31]:
df.sort_values('col1') #col1을 기준으로 내림차수!

   col1 col2  col3
1     1    a     1
0     2    a     0
2     4    b     9
3     6  NaN     4
4     7    d     2
5    10    c     3

In [32]:
#ascending=False는 반대로 돌리는 명령! 내림차수로 변경!!!
df.sort_values('col1', ascending=False)

   col1 col2  col3
5    10    c     3
4     7    d     2
3     6  NaN     4
2     4    b     9
0     2    a     0
1     1    a     1

In [33]:
df.sort_values(['col1', 'col2'])

   col1 col2  col3
1     1    a     1
0     2    a     0
2     4    b     9
3     6  NaN     4
4     7    d     2
5    10    c     3

In [35]:
#조건으로 검색하기
df = pd.DataFrame(np.random.rand(5,2), columns = ['a','b'])
df

          a         b
0  0.650704  0.614289
1  0.223117  0.707856
2  0.612856  0.547963
3  0.289103  0.531152
4  0.492781  0.312418

In [36]:
df['a']

0    0.650704
1    0.223117
2    0.612856
3    0.289103
4    0.492781
Name: a, dtype: float64

In [37]:
df['a'] < 0.5

0    False
1     True
2    False
3     True
4     True
Name: a, dtype: bool

In [38]:
df['b'] > 0.3

0    True
1    True
2    True
3    True
4    True
Name: b, dtype: bool

In [43]:
#df['a'] and df['b']이거를 df로 감싸준다
df[(df['a']<0.5)&(df['b']>0.3)]

          a         b
1  0.223117  0.707856
3  0.289103  0.531152
4  0.492781  0.312418

In [44]:
df.query('a<0.5 and b>0.3') #query 함수로 조건문 입력 가능

          a         b
1  0.223117  0.707856
3  0.289103  0.531152
4  0.492781  0.312418

In [62]:
#문자열일 때 조건 검색
df_str = pd.DataFrame({
    'Animal': ['Dog', 'Cat', 'Cat', 'Pig', 'Cat'],
    'Name': ['Happy', 'Sam', 'Toby', 'Mini', 'Rocky']
})
df_str

  Animal   Name
0    Dog  Happy
1    Cat    Sam
2    Cat   Toby
3    Pig   Mini
4    Cat  Rocky

In [51]:
#.str.contains() 함수로 문자열 이것이 포함돼 있는지 검색
df_str['Animal'].str.contains("Cat")

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [52]:
#.str.match()함수로도 가능
df_str.Animal.str.match("Cat")

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [53]:
df_str.Name.str.match("Happy")

0     True
1    False
2    False
3    False
4    False
Name: Name, dtype: bool

In [60]:
#검색해서 해당하는 부분만 df로 생성
df_str[df_str.Animal.str.match("Cat")]

  Animal   Name
1    Cat    Sam
2    Cat   Toby
4    Cat  Rocky

In [64]:
#함수로 데이터 처리하기~
df = pd.DataFrame(np.arange(5), columns=['num'])
df

   num
0    0
1    1
2    2
3    3
4    4

In [65]:
def square(x):
    return x**2

df['num']

0    0
1    1
2    2
3    3
4    4
Name: num, dtype: int32

In [66]:
df['num'].apply(square) #square함수에 들어가서 각각 제곱을 해준다.

0     0
1     1
2     4
3     9
4    16
Name: num, dtype: int64

In [68]:
df_num = df['num'].apply(square) #변수에 지정해준다.
df_num

0     0
1     1
2     4
3     9
4    16
Name: num, dtype: int64

In [69]:
df.num.apply(lambda x:x**2) #lambda함수를 활용하여 바로 apply 할 수도 있음

0     0
1     1
2     4
3     9
4    16
Name: num, dtype: int64

In [70]:
df = pd.DataFrame(columns=["phone"])
df.loc[0] = "010-1234-1235"
df.loc[1] = "공일공-일이삼사-1235"
df.loc[2] = "010.1234.일이삼오"
df.loc[3] = "공1공-1234.1이3오"
df["preprocess_phone"] = '' #속성을 만들고 값은 비워놓기
df

           phone preprocess_phone
0  010-1234-1235
1  공일공-일이삼사-1235
2  010.1234.일이삼오
3  공1공-1234.1이3오

In [71]:
def get_preprocess_phone(phone): #phone에 input값이 들어오면 한글을 숫자로, -이나 .은 빈칸으로 변환
    mapping_dict = {
    "공": "0",
    "일": "1",
    "이": "2",
    "삼": "3",
    "사": "4",
    "오": "5",
    "-": "",
    ".": "",
    }
    for k, v in mapping_dict.items(): #dict 안의 값을 item으로 불러와서 k, v에 넣는다.
        phone = phone.replace(k, v) #phone 값에 replace(대체, 업데이트) 함수를 활용하여 k, v값을 넣는다.
    return phone #phone 값을 return한다.

In [77]:
df['phone'] #df[속성]하면 시리즈로 나온다.

0    010-1234-1235
1    공일공-일이삼사-1235
2    010.1234.일이삼오
3    공1공-1234.1이3오
Name: phone, dtype: object

In [78]:
#빈 속성에 phont에 함수를 apply한 값을 넣어준다.
df["preprocess_phone"] = df['phone'].apply(get_preprocess_phone)

In [79]:
df

           phone preprocess_phone
0  010-1234-1235      01012341235
1  공일공-일이삼사-1235      01012341235
2  010.1234.일이삼오      01012341235
3  공1공-1234.1이3오      01012341235

In [81]:
df.to_csv("df_ex1.csv") #엑셀로 옮기면 유니코드 에러로 한글이 깨진다.

In [82]:
df.to_csv("df_ex1.csv", encoding='cp949') #엑셀에서 불러올 수 있도록 인코딩 해준다.

In [83]:
#성별 구분 프로그램
df = pd.DataFrame([0,0,1,1,0], columns = ['sex'])
print(df, '\n')

   sex
0    0
1    0
2    1
3    1
4    0

In [84]:
#replace함수는 대체하는 함수. 딕셔너리 형태로 키, 값을 넣으면 키가 값으로 변한다.
df.sex.replace({0: 'Male', 1: 'Female'})

0      Male
1      Male
2    Female
3    Female
4      Male
Name: sex, dtype: object

In [85]:
df

   sex
0    0
1    0
2    1
3    1
4    0

In [86]:
#inplace=True하면 replace와 다르게 바로 적용됨.
df.sex.replace({0: 'male', 1:'female'}, inplace=True)

In [87]:
df

      sex
0    male
1    male
2  female
3  female
4    male

In [88]:
#그룹으로 묶기 groupby() 활용
df = pd.DataFrame({'key': ['a','b','c','a','b','c']})
df

  key
0   a
1   b
2   c
3   a
4   b
5   c

In [90]:
df = pd.DataFrame({'key': ['a','b','c','a','b','c'], 'data':range(6)})
df

  key  data
0   a     0
1   b     1
2   c     2
3   a     3
4   b     4
5   c     5

In [91]:
df.groupby('key') #key로 묶는다.

In [92]:
df.groupby('key').sum() #그룹 별로 묶어준다.

     data
key
a       3
b       5
c       7

In [94]:
#key와 data를 같이 묶기
df.groupby(['key', 'data']).sum() #Series를 불러올 땐 리스트 형식으로 불러온다.

Empty DataFrame
Columns: []
Index: [(a, 0), (a, 3), (b, 1), (b, 4), (c, 2), (c, 5)]

In [96]:
#aggregate: groupby를 통해 집계 한 번에 계산
df.groupby('key').aggregate(['min',np.median,max]) #key로 묶고, 한 번에 집계

    data
     min median max
key
a      0    1.5   3
b      1    2.5   4
c      2    3.5   5

In [100]:
df.groupby('key').aggregate({'data': 'min', 'data':np.sum})

     data
key
a       3
b       5
c       7